app/Sections/Exports/UsersExport.php

select * from `users`
---
    public function collection()
    {
        return User::all();