app/Http/Controllers/AuthController.php

    public function signup(Request $request)
    {
        $request->validate([
            'name' => 'required|string',
            'email' => 'required|string|email|unique:users',
            'password' => 'required|string|confirmed'
        ]);

        $user = new User([
            'name' => $request->name,
            'email' => $request->email,
            'password' => bcrypt($request->password),
            'activation_token' => str_random(60)
        ]);

        $user->save();
---
insert into `users` (`name`, `email`, `password`, `activation_token`, `updated_at`, `created_at`) values ('Karen', 'karenhakobyan1994@gmail.com', 'y$HrwKXv/qVvpC7G7P75YFzumS2BXbrikRes/KWnzuVcTbxXmcPmNPe', 'CytSIeBvwTiznnADg1z13POPIieZ8JzaejCkIgOQesPc6Vl7Xewu9Ga6ohZm', '2018-07-17 02:53:56', '2018-07-17 02:53:56')

    public function signupActivate($token)
    {
        $user = User::where('activation_token', $token)->first();

        if (!$user) {
            return response()->json([
                'message' => 'This activation token is invalid.'
            ], 404);
        }

        $user->active = true;
        $user->activation_token = '';
        $user->save();
---
select * from `users` where `activation_token` = 'CytSIeBvwTiznnADg1z13POPIieZ8JzaejCkIgOQesPc6Vl7Xewu9Ga6ohZm' and `users`.`deleted_at` is null limit 1
update `users` set `active` = '1', `activation_token` = '', `updated_at` = '2018-07-17 02:55:14' where `id` = '10'